Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/pio/pic32cm2532jh00048.h
#define PIN_PA00H_AC_CMP2                          _UL_(0)     
#define MUX_PA00H_AC_CMP2                          _UL_(7)     
#define PINMUX_PA00H_AC_CMP2                       ((PIN_PA00H_AC_CMP2 << 16) | MUX_PA00H_AC_CMP2)
#define PORT_PA00H_AC_CMP2                         (_UL_(1) << 0)

#define PIN_PA24H_AC_CMP2                          _UL_(24)    
#define MUX_PA24H_AC_CMP2                          _UL_(7)     
#define PINMUX_PA24H_AC_CMP2                       ((PIN_PA24H_AC_CMP2 << 16) | MUX_PA24H_AC_CMP2)
#define PORT_PA24H_AC_CMP2                         (_UL_(1) << 24)

#define PIN_PA01H_AC_CMP3                          _UL_(1)     
#define MUX_PA01H_AC_CMP3                          _UL_(7)     
#define PINMUX_PA01H_AC_CMP3                       ((PIN_PA01H_AC_CMP3 << 16) | MUX_PA01H_AC_CMP3)
#define PORT_PA01H_AC_CMP3                         (_UL_(1) << 1)

#define PIN_PA25H_AC_CMP3                          _UL_(25)    
#define MUX_PA25H_AC_CMP3                          _UL_(7)     
#define PINMUX_PA25H_AC_CMP3                       ((PIN_PA25H_AC_CMP3 << 16) | MUX_PA25H_AC_CMP3)
#define PORT_PA25H_AC_CMP3                         (_UL_(1) << 25)

/* ========== PORT definition for ADC0 peripheral ========== */
#define PIN_PA02B_ADC0_AIN0                        _UL_(2)     
#define MUX_PA02B_ADC0_AIN0                        _UL_(1)     
#define PINMUX_PA02B_ADC0_AIN0                     ((PIN_PA02B_ADC0_AIN0 << 16) | MUX_PA02B_ADC0_AIN0)
#define PORT_PA02B_ADC0_AIN0                       (_UL_(1) << 2)

#define PIN_PA03B_ADC0_AIN1                        _UL_(3)     
#define MUX_PA03B_ADC0_AIN1                        _UL_(1)     
#define PINMUX_PA03B_ADC0_AIN1                     ((PIN_PA03B_ADC0_AIN1 << 16) | MUX_PA03B_ADC0_AIN1)
#define PORT_PA03B_ADC0_AIN1                       (_UL_(1) << 3)

#define PIN_PB08B_ADC0_AIN2                        _UL_(40)    
#define MUX_PB08B_ADC0_AIN2                        _UL_(1)     
#define PINMUX_PB08B_ADC0_AIN2                     ((PIN_PB08B_ADC0_AIN2 << 16) | MUX_PB08B_ADC0_AIN2)
#define PORT_PB08B_ADC0_AIN2                       (_UL_(1) << 8)

#define PIN_PB09B_ADC0_AIN3                        _UL_(41)    
#define MUX_PB09B_ADC0_AIN3                        _UL_(1)     
#define PINMUX_PB09B_ADC0_AIN3                     ((PIN_PB09B_ADC0_AIN3 << 16) | MUX_PB09B_ADC0_AIN3)
#define PORT_PB09B_ADC0_AIN3                       (_UL_(1) << 9)

#define PIN_PA04B_ADC0_AIN4                        _UL_(4)     
#define MUX_PA04B_ADC0_AIN4                        _UL_(1)     
#define PINMUX_PA04B_ADC0_AIN4                     ((PIN_PA04B_ADC0_AIN4 << 16) | MUX_PA04B_ADC0_AIN4)
#define PORT_PA04B_ADC0_AIN4                       (_UL_(1) << 4)

#define PIN_PA05B_ADC0_AIN5                        _UL_(5)     
#define MUX_PA05B_ADC0_AIN5                        _UL_(1)     
#define PINMUX_PA05B_ADC0_AIN5                     ((PIN_PA05B_ADC0_AIN5 << 16) | MUX_PA05B_ADC0_AIN5)
#define PORT_PA05B_ADC0_AIN5                       (_UL_(1) << 5)

#define PIN_PA06B_ADC0_AIN6                        _UL_(6)     
#define MUX_PA06B_ADC0_AIN6                        _UL_(1)     
#define PINMUX_PA06B_ADC0_AIN6                     ((PIN_PA06B_ADC0_AIN6 << 16) | MUX_PA06B_ADC0_AIN6)
#define PORT_PA06B_ADC0_AIN6                       (_UL_(1) << 6)

#define PIN_PA07B_ADC0_AIN7                        _UL_(7)     
#define MUX_PA07B_ADC0_AIN7                        _UL_(1)     
#define PINMUX_PA07B_ADC0_AIN7                     ((PIN_PA07B_ADC0_AIN7 << 16) | MUX_PA07B_ADC0_AIN7)
#define PORT_PA07B_ADC0_AIN7                       (_UL_(1) << 7)

#define PIN_PA08B_ADC0_AIN8                        _UL_(8)     
#define MUX_PA08B_ADC0_AIN8                        _UL_(1)     
#define PINMUX_PA08B_ADC0_AIN8                     ((PIN_PA08B_ADC0_AIN8 << 16) | MUX_PA08B_ADC0_AIN8)
#define PORT_PA08B_ADC0_AIN8                       (_UL_(1) << 8)

#define PIN_PA09B_ADC0_AIN9                        _UL_(9)     
#define MUX_PA09B_ADC0_AIN9                        _UL_(1)     
#define PINMUX_PA09B_ADC0_AIN9                     ((PIN_PA09B_ADC0_AIN9 << 16) | MUX_PA09B_ADC0_AIN9)
#define PORT_PA09B_ADC0_AIN9                       (_UL_(1) << 9)

#define PIN_PA10B_ADC0_AIN10                       _UL_(10)    
#define MUX_PA10B_ADC0_AIN10                       _UL_(1)     
#define PINMUX_PA10B_ADC0_AIN10                    ((PIN_PA10B_ADC0_AIN10 << 16) | MUX_PA10B_ADC0_AIN10)
#define PORT_PA10B_ADC0_AIN10                      (_UL_(1) << 10)

#define PIN_PA11B_ADC0_AIN11                       _UL_(11)    
#define MUX_PA11B_ADC0_AIN11                       _UL_(1)     
#define PINMUX_PA11B_ADC0_AIN11                    ((PIN_PA11B_ADC0_AIN11 << 16) | MUX_PA11B_ADC0_AIN11)
#define PORT_PA11B_ADC0_AIN11                      (_UL_(1) << 11)

#define PIN_PA03B_ADC0_VREFP                       _UL_(3)     
#define MUX_PA03B_ADC0_VREFP                       _UL_(1)     
#define PINMUX_PA03B_ADC0_VREFP                    ((PIN_PA03B_ADC0_VREFP << 16) | MUX_PA03B_ADC0_VREFP)
#define PORT_PA03B_ADC0_VREFP                      (_UL_(1) << 3)

/* ========== PORT definition for ADC1 peripheral ========== */
#define PIN_PB02B_ADC1_AIN2                        _UL_(34)    
#define MUX_PB02B_ADC1_AIN2                        _UL_(1)     
#define PINMUX_PB02B_ADC1_AIN2                     ((PIN_PB02B_ADC1_AIN2 << 16) | MUX_PB02B_ADC1_AIN2)
#define PORT_PB02B_ADC1_AIN2                       (_UL_(1) << 2)

#define PIN_PB03B_ADC1_AIN3                        _UL_(35)    
#define MUX_PB03B_ADC1_AIN3                        _UL_(1)     
#define PINMUX_PB03B_ADC1_AIN3                     ((PIN_PB03B_ADC1_AIN3 << 16) | MUX_PB03B_ADC1_AIN3)
#define PORT_PB03B_ADC1_AIN3                       (_UL_(1) << 3)

#define PIN_PB08B_ADC1_AIN4                        _UL_(40)    
#define MUX_PB08B_ADC1_AIN4                        _UL_(1)     
#define PINMUX_PB08B_ADC1_AIN4                     ((PIN_PB08B_ADC1_AIN4 << 16) | MUX_PB08B_ADC1_AIN4)
#define PORT_PB08B_ADC1_AIN4                       (_UL_(1) << 8)

#define PIN_PB09B_ADC1_AIN5                        _UL_(41)    
#define MUX_PB09B_ADC1_AIN5                        _UL_(1)     
#define PINMUX_PB09B_ADC1_AIN5                     ((PIN_PB09B_ADC1_AIN5 << 16) | MUX_PB09B_ADC1_AIN5)
#define PORT_PB09B_ADC1_AIN5                       (_UL_(1) << 9)

#define PIN_PA08B_ADC1_AIN10                       _UL_(8)     
#define MUX_PA08B_ADC1_AIN10                       _UL_(1)     
#define PINMUX_PA08B_ADC1_AIN10                    ((PIN_PA08B_ADC1_AIN10 << 16) | MUX_PA08B_ADC1_AIN10)
#define PORT_PA08B_ADC1_AIN10                      (_UL_(1) << 8)

