Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/pio/pic32cm2532jh00048.h
#define PIN_PB02K_PTC_DS8                          _UL_(34)    
#define MUX_PB02K_PTC_DS8                          _UL_(10)    
#define PINMUX_PB02K_PTC_DS8                       ((PIN_PB02K_PTC_DS8 << 16) | MUX_PB02K_PTC_DS8)
#define PORT_PB02K_PTC_DS8                         (_UL_(1) << 2)

#define PIN_PB03K_PTC_DS9                          _UL_(35)    
#define MUX_PB03K_PTC_DS9                          _UL_(10)    
#define PINMUX_PB03K_PTC_DS9                       ((PIN_PB03K_PTC_DS9 << 16) | MUX_PB03K_PTC_DS9)
#define PORT_PB03K_PTC_DS9                         (_UL_(1) << 3)

#define PIN_PB08K_PTC_DS14                         _UL_(40)    
#define MUX_PB08K_PTC_DS14                         _UL_(10)    
#define PINMUX_PB08K_PTC_DS14                      ((PIN_PB08K_PTC_DS14 << 16) | MUX_PB08K_PTC_DS14)
#define PORT_PB08K_PTC_DS14                        (_UL_(1) << 8)

#define PIN_PB09K_PTC_DS15                         _UL_(41)    
#define MUX_PB09K_PTC_DS15                         _UL_(10)    
#define PINMUX_PB09K_PTC_DS15                      ((PIN_PB09K_PTC_DS15 << 16) | MUX_PB09K_PTC_DS15)
#define PORT_PB09K_PTC_DS15                        (_UL_(1) << 9)

#define PIN_PA08K_PTC_DS16                         _UL_(8)     
#define MUX_PA08K_PTC_DS16                         _UL_(10)    
#define PINMUX_PA08K_PTC_DS16                      ((PIN_PA08K_PTC_DS16 << 16) | MUX_PA08K_PTC_DS16)
#define PORT_PA08K_PTC_DS16                        (_UL_(1) << 8)

#define PIN_PA09K_PTC_DS17                         _UL_(9)     
#define MUX_PA09K_PTC_DS17                         _UL_(10)    
#define PINMUX_PA09K_PTC_DS17                      ((PIN_PA09K_PTC_DS17 << 16) | MUX_PA09K_PTC_DS17)
#define PORT_PA09K_PTC_DS17                        (_UL_(1) << 9)

#define PIN_PA10K_PTC_DS18                         _UL_(10)    
#define MUX_PA10K_PTC_DS18                         _UL_(10)    
#define PINMUX_PA10K_PTC_DS18                      ((PIN_PA10K_PTC_DS18 << 16) | MUX_PA10K_PTC_DS18)
#define PORT_PA10K_PTC_DS18                        (_UL_(1) << 10)

#define PIN_PA11K_PTC_DS19                         _UL_(11)    
#define MUX_PA11K_PTC_DS19                         _UL_(10)    
#define PINMUX_PA11K_PTC_DS19                      ((PIN_PA11K_PTC_DS19 << 16) | MUX_PA11K_PTC_DS19)
#define PORT_PA11K_PTC_DS19                        (_UL_(1) << 11)

#define PIN_PA16K_PTC_DS20                         _UL_(16)    
#define MUX_PA16K_PTC_DS20                         _UL_(10)    
#define PINMUX_PA16K_PTC_DS20                      ((PIN_PA16K_PTC_DS20 << 16) | MUX_PA16K_PTC_DS20)
#define PORT_PA16K_PTC_DS20                        (_UL_(1) << 16)

#define PIN_PA17K_PTC_DS21                         _UL_(17)    
#define MUX_PA17K_PTC_DS21                         _UL_(10)    
#define PINMUX_PA17K_PTC_DS21                      ((PIN_PA17K_PTC_DS21 << 16) | MUX_PA17K_PTC_DS21)
#define PORT_PA17K_PTC_DS21                        (_UL_(1) << 17)

#define PIN_PA18K_PTC_DS22                         _UL_(18)    
#define MUX_PA18K_PTC_DS22                         _UL_(10)    
#define PINMUX_PA18K_PTC_DS22                      ((PIN_PA18K_PTC_DS22 << 16) | MUX_PA18K_PTC_DS22)
#define PORT_PA18K_PTC_DS22                        (_UL_(1) << 18)

#define PIN_PA19K_PTC_DS23                         _UL_(19)    
#define MUX_PA19K_PTC_DS23                         _UL_(10)    
#define PINMUX_PA19K_PTC_DS23                      ((PIN_PA19K_PTC_DS23 << 16) | MUX_PA19K_PTC_DS23)
#define PORT_PA19K_PTC_DS23                        (_UL_(1) << 19)

#define PIN_PA20K_PTC_DS24                         _UL_(20)    
#define MUX_PA20K_PTC_DS24                         _UL_(10)    
#define PINMUX_PA20K_PTC_DS24                      ((PIN_PA20K_PTC_DS24 << 16) | MUX_PA20K_PTC_DS24)
#define PORT_PA20K_PTC_DS24                        (_UL_(1) << 20)

#define PIN_PA21K_PTC_DS25                         _UL_(21)    
#define MUX_PA21K_PTC_DS25                         _UL_(10)    
#define PINMUX_PA21K_PTC_DS25                      ((PIN_PA21K_PTC_DS25 << 16) | MUX_PA21K_PTC_DS25)
#define PORT_PA21K_PTC_DS25                        (_UL_(1) << 21)

#define PIN_PA22K_PTC_DS26                         _UL_(22)    
#define MUX_PA22K_PTC_DS26                         _UL_(10)    
#define PINMUX_PA22K_PTC_DS26                      ((PIN_PA22K_PTC_DS26 << 16) | MUX_PA22K_PTC_DS26)
#define PORT_PA22K_PTC_DS26                        (_UL_(1) << 22)

#define PIN_PA23K_PTC_DS27                         _UL_(23)    
#define MUX_PA23K_PTC_DS27                         _UL_(10)    
#define PINMUX_PA23K_PTC_DS27                      ((PIN_PA23K_PTC_DS27 << 16) | MUX_PA23K_PTC_DS27)
#define PORT_PA23K_PTC_DS27                        (_UL_(1) << 23)

#define PIN_PA08B_PTC_X0                           _UL_(8)     
#define MUX_PA08B_PTC_X0                           _UL_(1)     
#define PINMUX_PA08B_PTC_X0                        ((PIN_PA08B_PTC_X0 << 16) | MUX_PA08B_PTC_X0)
#define PORT_PA08B_PTC_X0                          (_UL_(1) << 8)

#define PIN_PA09B_PTC_X1                           _UL_(9)     
#define MUX_PA09B_PTC_X1                           _UL_(1)     
#define PINMUX_PA09B_PTC_X1                        ((PIN_PA09B_PTC_X1 << 16) | MUX_PA09B_PTC_X1)
#define PORT_PA09B_PTC_X1                          (_UL_(1) << 9)

#define PIN_PA10B_PTC_X2                           _UL_(10)    
#define MUX_PA10B_PTC_X2                           _UL_(1)     
#define PINMUX_PA10B_PTC_X2                        ((PIN_PA10B_PTC_X2 << 16) | MUX_PA10B_PTC_X2)
#define PORT_PA10B_PTC_X2                          (_UL_(1) << 10)

#define PIN_PA11B_PTC_X3                           _UL_(11)    
#define MUX_PA11B_PTC_X3                           _UL_(1)     
#define PINMUX_PA11B_PTC_X3                        ((PIN_PA11B_PTC_X3 << 16) | MUX_PA11B_PTC_X3)
#define PORT_PA11B_PTC_X3                          (_UL_(1) << 11)

#define PIN_PA16B_PTC_X4                           _UL_(16)    
#define MUX_PA16B_PTC_X4                           _UL_(1)     
#define PINMUX_PA16B_PTC_X4                        ((PIN_PA16B_PTC_X4 << 16) | MUX_PA16B_PTC_X4)
#define PORT_PA16B_PTC_X4                          (_UL_(1) << 16)

#define PIN_PA17B_PTC_X5                           _UL_(17)    
#define MUX_PA17B_PTC_X5                           _UL_(1)     
#define PINMUX_PA17B_PTC_X5                        ((PIN_PA17B_PTC_X5 << 16) | MUX_PA17B_PTC_X5)
#define PORT_PA17B_PTC_X5                          (_UL_(1) << 17)

#define PIN_PA18B_PTC_X6                           _UL_(18)    
#define MUX_PA18B_PTC_X6                           _UL_(1)     
#define PINMUX_PA18B_PTC_X6                        ((PIN_PA18B_PTC_X6 << 16) | MUX_PA18B_PTC_X6)
#define PORT_PA18B_PTC_X6                          (_UL_(1) << 18)

#define PIN_PA19B_PTC_X7                           _UL_(19)    
#define MUX_PA19B_PTC_X7                           _UL_(1)     
#define PINMUX_PA19B_PTC_X7                        ((PIN_PA19B_PTC_X7 << 16) | MUX_PA19B_PTC_X7)
#define PORT_PA19B_PTC_X7                          (_UL_(1) << 19)

#define PIN_PA20B_PTC_X8                           _UL_(20)    
#define MUX_PA20B_PTC_X8                           _UL_(1)     
#define PINMUX_PA20B_PTC_X8                        ((PIN_PA20B_PTC_X8 << 16) | MUX_PA20B_PTC_X8)
#define PORT_PA20B_PTC_X8                          (_UL_(1) << 20)

