Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/pio/pic32cm2532jh00048.h
#define PIN_PA21B_PTC_X9                           _UL_(21)    
#define MUX_PA21B_PTC_X9                           _UL_(1)     
#define PINMUX_PA21B_PTC_X9                        ((PIN_PA21B_PTC_X9 << 16) | MUX_PA21B_PTC_X9)
#define PORT_PA21B_PTC_X9                          (_UL_(1) << 21)

#define PIN_PA22B_PTC_X10                          _UL_(22)    
#define MUX_PA22B_PTC_X10                          _UL_(1)     
#define PINMUX_PA22B_PTC_X10                       ((PIN_PA22B_PTC_X10 << 16) | MUX_PA22B_PTC_X10)
#define PORT_PA22B_PTC_X10                         (_UL_(1) << 22)

#define PIN_PA23B_PTC_X11                          _UL_(23)    
#define MUX_PA23B_PTC_X11                          _UL_(1)     
#define PINMUX_PA23B_PTC_X11                       ((PIN_PA23B_PTC_X11 << 16) | MUX_PA23B_PTC_X11)
#define PORT_PA23B_PTC_X11                         (_UL_(1) << 23)

#define PIN_PA02B_PTC_Y0                           _UL_(2)     
#define MUX_PA02B_PTC_Y0                           _UL_(1)     
#define PINMUX_PA02B_PTC_Y0                        ((PIN_PA02B_PTC_Y0 << 16) | MUX_PA02B_PTC_Y0)
#define PORT_PA02B_PTC_Y0                          (_UL_(1) << 2)

#define PIN_PA03B_PTC_Y1                           _UL_(3)     
#define MUX_PA03B_PTC_Y1                           _UL_(1)     
#define PINMUX_PA03B_PTC_Y1                        ((PIN_PA03B_PTC_Y1 << 16) | MUX_PA03B_PTC_Y1)
#define PORT_PA03B_PTC_Y1                          (_UL_(1) << 3)

#define PIN_PA04B_PTC_Y2                           _UL_(4)     
#define MUX_PA04B_PTC_Y2                           _UL_(1)     
#define PINMUX_PA04B_PTC_Y2                        ((PIN_PA04B_PTC_Y2 << 16) | MUX_PA04B_PTC_Y2)
#define PORT_PA04B_PTC_Y2                          (_UL_(1) << 4)

#define PIN_PA05B_PTC_Y3                           _UL_(5)     
#define MUX_PA05B_PTC_Y3                           _UL_(1)     
#define PINMUX_PA05B_PTC_Y3                        ((PIN_PA05B_PTC_Y3 << 16) | MUX_PA05B_PTC_Y3)
#define PORT_PA05B_PTC_Y3                          (_UL_(1) << 5)

#define PIN_PA06B_PTC_Y4                           _UL_(6)     
#define MUX_PA06B_PTC_Y4                           _UL_(1)     
#define PINMUX_PA06B_PTC_Y4                        ((PIN_PA06B_PTC_Y4 << 16) | MUX_PA06B_PTC_Y4)
#define PORT_PA06B_PTC_Y4                          (_UL_(1) << 6)

#define PIN_PA07B_PTC_Y5                           _UL_(7)     
#define MUX_PA07B_PTC_Y5                           _UL_(1)     
#define PINMUX_PA07B_PTC_Y5                        ((PIN_PA07B_PTC_Y5 << 16) | MUX_PA07B_PTC_Y5)
#define PORT_PA07B_PTC_Y5                          (_UL_(1) << 7)

#define PIN_PB02B_PTC_Y8                           _UL_(34)    
#define MUX_PB02B_PTC_Y8                           _UL_(1)     
#define PINMUX_PB02B_PTC_Y8                        ((PIN_PB02B_PTC_Y8 << 16) | MUX_PB02B_PTC_Y8)
#define PORT_PB02B_PTC_Y8                          (_UL_(1) << 2)

#define PIN_PB03B_PTC_Y9                           _UL_(35)    
#define MUX_PB03B_PTC_Y9                           _UL_(1)     
#define PINMUX_PB03B_PTC_Y9                        ((PIN_PB03B_PTC_Y9 << 16) | MUX_PB03B_PTC_Y9)
#define PORT_PB03B_PTC_Y9                          (_UL_(1) << 3)

#define PIN_PB08B_PTC_Y14                          _UL_(40)    
#define MUX_PB08B_PTC_Y14                          _UL_(1)     
#define PINMUX_PB08B_PTC_Y14                       ((PIN_PB08B_PTC_Y14 << 16) | MUX_PB08B_PTC_Y14)
#define PORT_PB08B_PTC_Y14                         (_UL_(1) << 8)

#define PIN_PB09B_PTC_Y15                          _UL_(41)    
#define MUX_PB09B_PTC_Y15                          _UL_(1)     
#define PINMUX_PB09B_PTC_Y15                       ((PIN_PB09B_PTC_Y15 << 16) | MUX_PB09B_PTC_Y15)
#define PORT_PB09B_PTC_Y15                         (_UL_(1) << 9)

#define PIN_PA08B_PTC_Y16                          _UL_(8)     
#define MUX_PA08B_PTC_Y16                          _UL_(1)     
#define PINMUX_PA08B_PTC_Y16                       ((PIN_PA08B_PTC_Y16 << 16) | MUX_PA08B_PTC_Y16)
#define PORT_PA08B_PTC_Y16                         (_UL_(1) << 8)

#define PIN_PA09B_PTC_Y17                          _UL_(9)     
#define MUX_PA09B_PTC_Y17                          _UL_(1)     
#define PINMUX_PA09B_PTC_Y17                       ((PIN_PA09B_PTC_Y17 << 16) | MUX_PA09B_PTC_Y17)
#define PORT_PA09B_PTC_Y17                         (_UL_(1) << 9)

#define PIN_PA10B_PTC_Y18                          _UL_(10)    
#define MUX_PA10B_PTC_Y18                          _UL_(1)     
#define PINMUX_PA10B_PTC_Y18                       ((PIN_PA10B_PTC_Y18 << 16) | MUX_PA10B_PTC_Y18)
#define PORT_PA10B_PTC_Y18                         (_UL_(1) << 10)

#define PIN_PA11B_PTC_Y19                          _UL_(11)    
#define MUX_PA11B_PTC_Y19                          _UL_(1)     
#define PINMUX_PA11B_PTC_Y19                       ((PIN_PA11B_PTC_Y19 << 16) | MUX_PA11B_PTC_Y19)
#define PORT_PA11B_PTC_Y19                         (_UL_(1) << 11)

#define PIN_PA16B_PTC_Y20                          _UL_(16)    
#define MUX_PA16B_PTC_Y20                          _UL_(1)     
#define PINMUX_PA16B_PTC_Y20                       ((PIN_PA16B_PTC_Y20 << 16) | MUX_PA16B_PTC_Y20)
#define PORT_PA16B_PTC_Y20                         (_UL_(1) << 16)

#define PIN_PA17B_PTC_Y21                          _UL_(17)    
#define MUX_PA17B_PTC_Y21                          _UL_(1)     
#define PINMUX_PA17B_PTC_Y21                       ((PIN_PA17B_PTC_Y21 << 16) | MUX_PA17B_PTC_Y21)
#define PORT_PA17B_PTC_Y21                         (_UL_(1) << 17)

#define PIN_PA18B_PTC_Y22                          _UL_(18)    
#define MUX_PA18B_PTC_Y22                          _UL_(1)     
#define PINMUX_PA18B_PTC_Y22                       ((PIN_PA18B_PTC_Y22 << 16) | MUX_PA18B_PTC_Y22)
#define PORT_PA18B_PTC_Y22                         (_UL_(1) << 18)

#define PIN_PA19B_PTC_Y23                          _UL_(19)    
#define MUX_PA19B_PTC_Y23                          _UL_(1)     
#define PINMUX_PA19B_PTC_Y23                       ((PIN_PA19B_PTC_Y23 << 16) | MUX_PA19B_PTC_Y23)
#define PORT_PA19B_PTC_Y23                         (_UL_(1) << 19)

#define PIN_PA20B_PTC_Y24                          _UL_(20)    
#define MUX_PA20B_PTC_Y24                          _UL_(1)     
#define PINMUX_PA20B_PTC_Y24                       ((PIN_PA20B_PTC_Y24 << 16) | MUX_PA20B_PTC_Y24)
#define PORT_PA20B_PTC_Y24                         (_UL_(1) << 20)

#define PIN_PA21B_PTC_Y25                          _UL_(21)    
#define MUX_PA21B_PTC_Y25                          _UL_(1)     
#define PINMUX_PA21B_PTC_Y25                       ((PIN_PA21B_PTC_Y25 << 16) | MUX_PA21B_PTC_Y25)
#define PORT_PA21B_PTC_Y25                         (_UL_(1) << 21)

#define PIN_PA22B_PTC_Y26                          _UL_(22)    
#define MUX_PA22B_PTC_Y26                          _UL_(1)     
#define PINMUX_PA22B_PTC_Y26                       ((PIN_PA22B_PTC_Y26 << 16) | MUX_PA22B_PTC_Y26)
#define PORT_PA22B_PTC_Y26                         (_UL_(1) << 22)

#define PIN_PA23B_PTC_Y27                          _UL_(23)    
#define MUX_PA23B_PTC_Y27                          _UL_(1)     
#define PINMUX_PA23B_PTC_Y27                       ((PIN_PA23B_PTC_Y27 << 16) | MUX_PA23B_PTC_Y27)
#define PORT_PA23B_PTC_Y27                         (_UL_(1) << 23)

/* ========== PORT definition for RSTC peripheral ========== */
#define PIN_PA00A_RSTC_EXTWAKE0                    _UL_(0)     
#define MUX_PA00A_RSTC_EXTWAKE0                    _UL_(0)     
#define PINMUX_PA00A_RSTC_EXTWAKE0                 ((PIN_PA00A_RSTC_EXTWAKE0 << 16) | MUX_PA00A_RSTC_EXTWAKE0)
#define PORT_PA00A_RSTC_EXTWAKE0                   (_UL_(1) << 0)

#define PIN_PA01A_RSTC_EXTWAKE1                    _UL_(1)     
#define MUX_PA01A_RSTC_EXTWAKE1                    _UL_(0)     
#define PINMUX_PA01A_RSTC_EXTWAKE1                 ((PIN_PA01A_RSTC_EXTWAKE1 << 16) | MUX_PA01A_RSTC_EXTWAKE1)
#define PORT_PA01A_RSTC_EXTWAKE1                   (_UL_(1) << 1)

#define PIN_PA02A_RSTC_EXTWAKE2                    _UL_(2)     
#define MUX_PA02A_RSTC_EXTWAKE2                    _UL_(0)     
#define PINMUX_PA02A_RSTC_EXTWAKE2                 ((PIN_PA02A_RSTC_EXTWAKE2 << 16) | MUX_PA02A_RSTC_EXTWAKE2)
#define PORT_PA02A_RSTC_EXTWAKE2                   (_UL_(1) << 2)

