Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/pio/pic32cm2532jh00048.h
#define PIN_PB09E_TC0_WO1                          _UL_(41)    
#define MUX_PB09E_TC0_WO1                          _UL_(4)     
#define PINMUX_PB09E_TC0_WO1                       ((PIN_PB09E_TC0_WO1 << 16) | MUX_PB09E_TC0_WO1)
#define PORT_PB09E_TC0_WO1                         (_UL_(1) << 9)

/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA24E_TC1_WO0                          _UL_(24)    
#define MUX_PA24E_TC1_WO0                          _UL_(4)     
#define PINMUX_PA24E_TC1_WO0                       ((PIN_PA24E_TC1_WO0 << 16) | MUX_PA24E_TC1_WO0)
#define PORT_PA24E_TC1_WO0                         (_UL_(1) << 24)

#define PIN_PB10E_TC1_WO0                          _UL_(42)    
#define MUX_PB10E_TC1_WO0                          _UL_(4)     
#define PINMUX_PB10E_TC1_WO0                       ((PIN_PB10E_TC1_WO0 << 16) | MUX_PB10E_TC1_WO0)
#define PORT_PB10E_TC1_WO0                         (_UL_(1) << 10)

#define PIN_PA25E_TC1_WO1                          _UL_(25)    
#define MUX_PA25E_TC1_WO1                          _UL_(4)     
#define PINMUX_PA25E_TC1_WO1                       ((PIN_PA25E_TC1_WO1 << 16) | MUX_PA25E_TC1_WO1)
#define PORT_PA25E_TC1_WO1                         (_UL_(1) << 25)

#define PIN_PB11E_TC1_WO1                          _UL_(43)    
#define MUX_PB11E_TC1_WO1                          _UL_(4)     
#define PINMUX_PB11E_TC1_WO1                       ((PIN_PB11E_TC1_WO1 << 16) | MUX_PB11E_TC1_WO1)
#define PORT_PB11E_TC1_WO1                         (_UL_(1) << 11)

/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PB02E_TC2_WO0                          _UL_(34)    
#define MUX_PB02E_TC2_WO0                          _UL_(4)     
#define PINMUX_PB02E_TC2_WO0                       ((PIN_PB02E_TC2_WO0 << 16) | MUX_PB02E_TC2_WO0)
#define PORT_PB02E_TC2_WO0                         (_UL_(1) << 2)

#define PIN_PB03E_TC2_WO1                          _UL_(35)    
#define MUX_PB03E_TC2_WO1                          _UL_(4)     
#define PINMUX_PB03E_TC2_WO1                       ((PIN_PB03E_TC2_WO1 << 16) | MUX_PB03E_TC2_WO1)
#define PORT_PB03E_TC2_WO1                         (_UL_(1) << 3)

/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA20E_TC3_WO0                          _UL_(20)    
#define MUX_PA20E_TC3_WO0                          _UL_(4)     
#define PINMUX_PA20E_TC3_WO0                       ((PIN_PA20E_TC3_WO0 << 16) | MUX_PA20E_TC3_WO0)
#define PORT_PA20E_TC3_WO0                         (_UL_(1) << 20)

#define PIN_PB22E_TC3_WO0                          _UL_(54)    
#define MUX_PB22E_TC3_WO0                          _UL_(4)     
#define PINMUX_PB22E_TC3_WO0                       ((PIN_PB22E_TC3_WO0 << 16) | MUX_PB22E_TC3_WO0)
#define PORT_PB22E_TC3_WO0                         (_UL_(1) << 22)

#define PIN_PA21E_TC3_WO1                          _UL_(21)    
#define MUX_PA21E_TC3_WO1                          _UL_(4)     
#define PINMUX_PA21E_TC3_WO1                       ((PIN_PA21E_TC3_WO1 << 16) | MUX_PA21E_TC3_WO1)
#define PORT_PA21E_TC3_WO1                         (_UL_(1) << 21)

#define PIN_PB23E_TC3_WO1                          _UL_(55)    
#define MUX_PB23E_TC3_WO1                          _UL_(4)     
#define PINMUX_PB23E_TC3_WO1                       ((PIN_PB23E_TC3_WO1 << 16) | MUX_PB23E_TC3_WO1)
#define PORT_PB23E_TC3_WO1                         (_UL_(1) << 23)

/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA18E_TC4_WO0                          _UL_(18)    
#define MUX_PA18E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA18E_TC4_WO0                       ((PIN_PA18E_TC4_WO0 << 16) | MUX_PA18E_TC4_WO0)
#define PORT_PA18E_TC4_WO0                         (_UL_(1) << 18)

#define PIN_PA14E_TC4_WO0                          _UL_(14)    
#define MUX_PA14E_TC4_WO0                          _UL_(4)     
#define PINMUX_PA14E_TC4_WO0                       ((PIN_PA14E_TC4_WO0 << 16) | MUX_PA14E_TC4_WO0)
#define PORT_PA14E_TC4_WO0                         (_UL_(1) << 14)

#define PIN_PA19E_TC4_WO1                          _UL_(19)    
#define MUX_PA19E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA19E_TC4_WO1                       ((PIN_PA19E_TC4_WO1 << 16) | MUX_PA19E_TC4_WO1)
#define PORT_PA19E_TC4_WO1                         (_UL_(1) << 19)

#define PIN_PA15E_TC4_WO1                          _UL_(15)    
#define MUX_PA15E_TC4_WO1                          _UL_(4)     
#define PINMUX_PA15E_TC4_WO1                       ((PIN_PA15E_TC4_WO1 << 16) | MUX_PA15E_TC4_WO1)
#define PORT_PA15E_TC4_WO1                         (_UL_(1) << 15)

/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA04F_TC5_WO0                          _UL_(4)     
#define MUX_PA04F_TC5_WO0                          _UL_(5)     
#define PINMUX_PA04F_TC5_WO0                       ((PIN_PA04F_TC5_WO0 << 16) | MUX_PA04F_TC5_WO0)
#define PORT_PA04F_TC5_WO0                         (_UL_(1) << 4)

#define PIN_PB02F_TC5_WO0                          _UL_(34)    
#define MUX_PB02F_TC5_WO0                          _UL_(5)     
#define PINMUX_PB02F_TC5_WO0                       ((PIN_PB02F_TC5_WO0 << 16) | MUX_PB02F_TC5_WO0)
#define PORT_PB02F_TC5_WO0                         (_UL_(1) << 2)

#define PIN_PA05F_TC5_WO1                          _UL_(5)     
#define MUX_PA05F_TC5_WO1                          _UL_(5)     
#define PINMUX_PA05F_TC5_WO1                       ((PIN_PA05F_TC5_WO1 << 16) | MUX_PA05F_TC5_WO1)
#define PORT_PA05F_TC5_WO1                         (_UL_(1) << 5)

#define PIN_PB03F_TC5_WO1                          _UL_(35)    
#define MUX_PB03F_TC5_WO1                          _UL_(5)     
#define PINMUX_PB03F_TC5_WO1                       ((PIN_PB03F_TC5_WO1 << 16) | MUX_PB03F_TC5_WO1)
#define PORT_PB03F_TC5_WO1                         (_UL_(1) << 3)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PA06F_TC6_WO0                          _UL_(6)     
#define MUX_PA06F_TC6_WO0                          _UL_(5)     
#define PINMUX_PA06F_TC6_WO0                       ((PIN_PA06F_TC6_WO0 << 16) | MUX_PA06F_TC6_WO0)
#define PORT_PA06F_TC6_WO0                         (_UL_(1) << 6)

#define PIN_PA07F_TC6_WO1                          _UL_(7)     
#define MUX_PA07F_TC6_WO1                          _UL_(5)     
#define PINMUX_PA07F_TC6_WO1                       ((PIN_PA07F_TC6_WO1 << 16) | MUX_PA07F_TC6_WO1)
#define PORT_PA07F_TC6_WO1                         (_UL_(1) << 7)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PA00F_TC7_WO0                          _UL_(0)     
#define MUX_PA00F_TC7_WO0                          _UL_(5)     
#define PINMUX_PA00F_TC7_WO0                       ((PIN_PA00F_TC7_WO0 << 16) | MUX_PA00F_TC7_WO0)
#define PORT_PA00F_TC7_WO0                         (_UL_(1) << 0)

#define PIN_PA01F_TC7_WO1                          _UL_(1)     
#define MUX_PA01F_TC7_WO1                          _UL_(5)     
#define PINMUX_PA01F_TC7_WO1                       ((PIN_PA01F_TC7_WO1 << 16) | MUX_PA01F_TC7_WO1)
#define PORT_PA01F_TC7_WO1                         (_UL_(1) << 1)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA04E_TCC0_WO0                         _UL_(4)     
#define MUX_PA04E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA04E_TCC0_WO0                      ((PIN_PA04E_TCC0_WO0 << 16) | MUX_PA04E_TCC0_WO0)
#define PORT_PA04E_TCC0_WO0                        (_UL_(1) << 4)

#define PIN_PA08E_TCC0_WO0                         _UL_(8)     
#define MUX_PA08E_TCC0_WO0                         _UL_(4)     
#define PINMUX_PA08E_TCC0_WO0                      ((PIN_PA08E_TCC0_WO0 << 16) | MUX_PA08E_TCC0_WO0)
#define PORT_PA08E_TCC0_WO0                        (_UL_(1) << 8)

#define PIN_PA05E_TCC0_WO1                         _UL_(5)     
#define MUX_PA05E_TCC0_WO1                         _UL_(4)     
#define PINMUX_PA05E_TCC0_WO1                      ((PIN_PA05E_TCC0_WO1 << 16) | MUX_PA05E_TCC0_WO1)
#define PORT_PA05E_TCC0_WO1                        (_UL_(1) << 5)

